"""src/eones/locales/ja.py"""

MESSAGES = {
    "past": "前",
    "future": "後",
    "year": ("年", "年"),
    "month": ("ヶ月", "ヶ月"),
    "week": ("週間", "週間"),
    "day": ("日", "日"),
    "hour": ("時間", "時間"),
    "minute": ("分", "分"),
    "second": ("秒", "秒"),
    "just_now": "たった今",
    "position": "suffix",
}

MONTHS = (
    "1月",
    "2月",
    "3月",
    "4月",
    "5月",
    "6月",
    "7月",
    "8月",
    "9月",
    "10月",
    "11月",
    "12月",
)

MONTHS_SHORT = (
    "1月",
    "2月",
    "3月",
    "4月",
    "5月",
    "6月",
    "7月",
    "8月",
    "9月",
    "10月",
    "11月",
    "12月",
)

DAYS = (
    "月曜日",
    "火曜日",
    "水曜日",
    "木曜日",
    "金曜日",
    "土曜日",
    "日曜日",
)

DAYS_SHORT = ("月", "火", "水", "木", "金", "土", "日")
